In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['priyanka','Aarvee','Rajvee','kushal'],
    "marks":[34,45,67,23],
    "city":['ahmedabad','surat','mumbai','palnpur']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

       name  marks       city
0  priyanka     34  ahmedabad
1    Aarvee     45      surat
2    Rajvee     67     mumbai
3    kushal     23    palnpur

In [5]:
df.to_csv('friends.csv')